ecetinturk/stm32-examples/005_LL_7_SEGMENT_DISPLAY_WITH_BUTTON/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f4xx.h"
#include "stm32f407xx.h"
#include "stm32f4xx_ll_bus.h"
#include "stm32f4xx_ll_rcc.h"
#include "stm32f4xx_ll_gpio.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
GPIO_InitTypeDef GPIO_InitStruct;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
int count = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
void GPIO_Config(void);
void Delay(uint32_t time);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void GPIO_Config()
{
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOA);
	LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_GPIOE);

	GPIO_InitStruct.Pin = LL_GPIO_PIN_0;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_INPUT;
	GPIO_InitStruct.Alternate = LL_GPIO_OUTPUT_PUSHPULL;
	GPIO_InitStruct.Pull = LL_GPIO_PULL_DOWN;
	GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;

	HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

	GPIO_InitStruct.Pin = LL_GPIO_PIN_0 |
							LL_GPIO_PIN_1 |
							LL_GPIO_PIN_2 |
							LL_GPIO_PIN_3 |
							LL_GPIO_PIN_4 |
							LL_GPIO_PIN_5 |
							LL_GPIO_PIN_6;
	GPIO_InitStruct.Mode = LL_GPIO_MODE_OUTPUT;
	GPIO_InitStruct.Alternate = LL_GPIO_OUTPUT_PUSHPULL;
	GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
	GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;

	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

void Delay(uint32_t time)
{
	while(time--);
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  GPIO_Config();
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  if (LL_GPIO_ReadInputPort(GPIOE) & LL_GPIO_PIN_0)
	  {
		  while (LL_GPIO_ReadInputPort(GPIOE) & LL_GPIO_PIN_0);
		  Delay(168000);

		  count++;
	  }

  	  switch (count)
	  {
		  case 0:
		  {
			  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_0 |
									LL_GPIO_PIN_1 |
									LL_GPIO_PIN_2 |
									LL_GPIO_PIN_3 |
									LL_GPIO_PIN_4 |
									LL_GPIO_PIN_6);
			  LL_GPIO_ResetOutputPin(GPIOA, LL_GPIO_PIN_5);
			  break;
		  }
		  case 1:
		  {
			  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_1 |
									LL_GPIO_PIN_2);
			  LL_GPIO_ResetOutputPin(GPIOA, LL_GPIO_PIN_0 |
									LL_GPIO_PIN_3 |
									LL_GPIO_PIN_4 |
									LL_GPIO_PIN_5 |
									LL_GPIO_PIN_6);
			  break;
		  }
		  case 2:
		  {
			  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_0 |
									LL_GPIO_PIN_1 |
									LL_GPIO_PIN_3 |
									LL_GPIO_PIN_4 |
									LL_GPIO_PIN_5);
			  LL_GPIO_ResetOutputPin(GPIOA, LL_GPIO_PIN_2 |
									LL_GPIO_PIN_6);
			  break;
		  }
		  case 3:
		  {
			  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_0 |
									LL_GPIO_PIN_1 |
									LL_GPIO_PIN_2 |
									LL_GPIO_PIN_3 |
									LL_GPIO_PIN_5);
			  LL_GPIO_ResetOutputPin(GPIOA, LL_GPIO_PIN_4 |
									LL_GPIO_PIN_6);
			  break;
		  }
		  case 4:
		  {
			  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_1 |
									LL_GPIO_PIN_2 |
									LL_GPIO_PIN_5 |
									LL_GPIO_PIN_6);
			  LL_GPIO_ResetOutputPin(GPIOA, LL_GPIO_PIN_0 |
									LL_GPIO_PIN_3 |
									LL_GPIO_PIN_4);
			  break;
		  }
		  case 5:
		  {
			  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_0 |
									LL_GPIO_PIN_2 |
									LL_GPIO_PIN_3 |
									LL_GPIO_PIN_5 |
									LL_GPIO_PIN_6);
			  LL_GPIO_ResetOutputPin(GPIOA, LL_GPIO_PIN_1 |
									LL_GPIO_PIN_4);
			  break;
		  }
		  case 6:
		  {
			  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_0 |
									LL_GPIO_PIN_2 |
									LL_GPIO_PIN_3 |
									LL_GPIO_PIN_4 |
									LL_GPIO_PIN_5 |
									LL_GPIO_PIN_6);
			  LL_GPIO_ResetOutputPin(GPIOA, LL_GPIO_PIN_1);
			  break;
		  }
		  case 7:
		  {
			  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_0 |
									LL_GPIO_PIN_1 |
									LL_GPIO_PIN_2);
			  LL_GPIO_ResetOutputPin(GPIOA, LL_GPIO_PIN_3 |
									LL_GPIO_PIN_4 |
									LL_GPIO_PIN_5 |
									LL_GPIO_PIN_6);
			  break;
		  }
		  case 8:
		  {
			  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_ALL);
			  break;
		  }
		  case 9:
		  {
			  LL_GPIO_SetOutputPin(GPIOA, LL_GPIO_PIN_0 |
									LL_GPIO_PIN_1 |
									LL_GPIO_PIN_2 |
									LL_GPIO_PIN_5 |
									LL_GPIO_PIN_6);
			  LL_GPIO_ResetOutputPin(GPIOA, LL_GPIO_PIN_3 |
									LL_GPIO_PIN_4);
			  break;
		  }
		  default:
		  {
			  count = 0;
			  break;
		  }
	  }
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 168;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
